# Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк
# и сохраните в переменные, выведите на экран.

a = 125
b = 2.34
c = 'my name'
d = True
print('a = {}, b = {}, c = {}, d = {}'.format(a, b, c, d))

name = input('Укажите ваше имя - ')
age = int(input('А сколько вам лет? '))
city_of_living = input('В каком городе вы живёте? ')

print('Приветствую тебя {} из славного города {}. Я посчитал, что ты родился в {} году.'.format(name, city_of_living, 2020-age))